ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-EVK/LPC55S69_McuLib_Blinky/McuLib/FreeRTOS/Source/portable/GCC/ARM_CM4F/port.c
/*
 * FreeRTOS Kernel V10.2.0
 * Copyright (C) 2019 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

/*-----------------------------------------------------------
 * FreeRTOS for 56800EX port by Richy Ye in Jan. 2013.
 *----------------------------------------------------------*/
/* Scheduler includes. */
#include "FreeRTOS.h"
#if McuLib_CONFIG_SDK_USE_FREERTOS

#include "portmacro.h" /* for configCPU_FAMILY */
#include "task.h"
#include "portTicks.h" /* for CPU_CORE_CLK_HZ used in configSYSTICK_CLOCK_HZ */
#if configSYSTICK_USE_LOW_POWER_TIMER
  #if McuLib_CONFIG_NXP_SDK_2_0_USED
    #include "fsl_lptmr.h" /* SDK low power timer interface */
  #elif McuLib_CONFIG_SDK_VERSION_USED == McuLib_CONFIG_SDK_PROCESSOR_EXPERT
    #include "LPTMR_PDD.h" /* PDD interface to low power timer */
    #include "SIM_PDD.h"   /* PDD interface to system integration module */
  #endif
#endif

#include "McuLib.h" /* include SDK and API used */
#if McuLib_CONFIG_CPU_IS_ARM_CORTEX_M

#if( configENABLE_TRUSTZONE == 1 )
  /* Secure components includes. */
  #include "secure_context.h"
  #include "secure_init.h"
#endif /* configENABLE_TRUSTZONE */

#undef MPU_WRAPPERS_INCLUDED_FROM_API_FILE

/**
 * The FreeRTOS Cortex M33 port can be configured to run on the Secure Side only
 * i.e. the processor boots as secure and never jumps to the non-secure side.
 * The Trust Zone support in the port must be disabled in order to run FreeRTOS
 * on the secure side. The following are the valid configuration seetings:
 *
 * 1. Run FreeRTOS on the Secure Side:
 *    configRUN_FREERTOS_SECURE_ONLY = 1 and configENABLE_TRUSTZONE = 0
 *
 * 2. Run FreeRTOS on the Non-Secure Side with Secure Side function call support:
 *    configRUN_FREERTOS_SECURE_ONLY = 0 and configENABLE_TRUSTZONE = 1
 *
 * 3. Run FreeRTOS on the Non-Secure Side only i.e. no Secure Side function call support:
 *    configRUN_FREERTOS_SECURE_ONLY = 0 and configENABLE_TRUSTZONE = 0
 */
#if( ( configRUN_FREERTOS_SECURE_ONLY == 1 ) && ( configENABLE_TRUSTZONE == 1 ) )
  #error TrustZone needs to be disabled in order to run FreeRTOS on the Secure Side.
#endif

#if( configENABLE_MPU == 1 )
  /**
   * @brief Constants required to manipulate the MPU.
   */
  #define portMPU_TYPE_REG          ( * ( ( volatile uint32_t * ) 0xe000ed90 ) )
  #define portMPU_CTRL_REG          ( * ( ( volatile uint32_t * ) 0xe000ed94 ) )
  #define portMPU_RNR_REG           ( * ( ( volatile uint32_t * ) 0xe000ed98 ) )

  #define portMPU_RBAR_REG          ( * ( ( volatile uint32_t * ) 0xe000ed9c ) )
  #define portMPU_RLAR_REG          ( * ( ( volatile uint32_t * ) 0xe000eda0 ) )

  #define portMPU_RBAR_A1_REG         ( * ( ( volatile uint32_t * ) 0xe000eda4 ) )
  #define portMPU_RLAR_A1_REG         ( * ( ( volatile uint32_t * ) 0xe000eda8 ) )

  #define portMPU_RBAR_A2_REG         ( * ( ( volatile uint32_t * ) 0xe000edac ) )
  #define portMPU_RLAR_A2_REG         ( * ( ( volatile uint32_t * ) 0xe000edb0 ) )

  #define portMPU_RBAR_A3_REG         ( * ( ( volatile uint32_t * ) 0xe000edb4 ) )
  #define portMPU_RLAR_A3_REG         ( * ( ( volatile uint32_t * ) 0xe000edb8 ) )

  #define portMPU_MAIR0_REG         ( * ( ( volatile uint32_t * ) 0xe000edc0 ) )
  #define portMPU_MAIR1_REG         ( * ( ( volatile uint32_t * ) 0xe000edc4 ) )

  #define portMPU_RBAR_ADDRESS_MASK     ( 0xffffffe0 ) /* Must be 32-byte aligned. */
  #define portMPU_RLAR_ADDRESS_MASK     ( 0xffffffe0 ) /* Must be 32-byte aligned. */

  #define portMPU_MAIR_ATTR0_POS        ( 0UL )
  #define portMPU_MAIR_ATTR0_MASK       ( 0x000000ff )

  #define portMPU_MAIR_ATTR1_POS        ( 8UL )
  #define portMPU_MAIR_ATTR1_MASK       ( 0x0000ff00 )

  #define portMPU_MAIR_ATTR2_POS        ( 16UL )
  #define portMPU_MAIR_ATTR2_MASK       ( 0x00ff0000 )

  #define portMPU_MAIR_ATTR3_POS        ( 24UL )
  #define portMPU_MAIR_ATTR3_MASK       ( 0xff000000 )

  #define portMPU_MAIR_ATTR4_POS        ( 0UL )
  #define portMPU_MAIR_ATTR4_MASK       ( 0x000000ff )

  #define portMPU_MAIR_ATTR5_POS        ( 8UL )
  #define portMPU_MAIR_ATTR5_MASK       ( 0x0000ff00 )

  #define portMPU_MAIR_ATTR6_POS        ( 16UL )
  #define portMPU_MAIR_ATTR6_MASK       ( 0x00ff0000 )

  #define portMPU_MAIR_ATTR7_POS        ( 24UL )
  #define portMPU_MAIR_ATTR7_MASK       ( 0xff000000 )

  #define portMPU_RLAR_ATTR_INDEX0      ( 0UL << 1UL )
  #define portMPU_RLAR_ATTR_INDEX1      ( 1UL << 1UL )
  #define portMPU_RLAR_ATTR_INDEX2      ( 2UL << 1UL )
  #define portMPU_RLAR_ATTR_INDEX3      ( 3UL << 1UL )
  #define portMPU_RLAR_ATTR_INDEX4      ( 4UL << 1UL )
  #define portMPU_RLAR_ATTR_INDEX5      ( 5UL << 1UL )
  #define portMPU_RLAR_ATTR_INDEX6      ( 6UL << 1UL )
  #define portMPU_RLAR_ATTR_INDEX7      ( 7UL << 1UL )

  #define portMPU_RLAR_REGION_ENABLE      ( 1UL )

  /* Enable privileged access to unmapped region. */
  #define portMPU_PRIV_BACKGROUND_ENABLE    ( 1UL << 2UL )

  /* Enable MPU. */
  #define portMPU_ENABLE            ( 1UL << 0UL )

  /* Expected value of the portMPU_TYPE register. */
  #define portEXPECTED_MPU_TYPE_VALUE     ( 8UL << 8UL ) /* 8 regions, unified. */
#endif /* configENABLE_MPU */

/* --------------------------------------------------- */
/* Let the user override the pre-loading of the initial LR with the address of
   prvTaskExitError() in case is messes up unwinding of the stack in the
   debugger. */
#ifdef configTASK_RETURN_ADDRESS
  #define portTASK_RETURN_ADDRESS   configTASK_RETURN_ADDRESS
#else
  #define portTASK_RETURN_ADDRESS   prvTaskExitError
#endif

/**
 * @brief If portPRELOAD_REGISTERS then registers will be given an initial value
 * when a task is created. This helps in debugging at the cost of code size.
 */
#define portPRELOAD_REGISTERS       1

/**
 * @brief A task is created without a secure context, and must call
 * portALLOCATE_SECURE_CONTEXT() to give itself a secure context before it makes
 * any secure calls.
 */
#define portNO_SECURE_CONTEXT       0
/* --------------------------------------------------- */
/* macros dealing with tick counter */
#if configSYSTICK_USE_LOW_POWER_TIMER
  #if !McuLib_CONFIG_PEX_SDK_USED
    /*! \todo */
    #define LPTMR0_BASE_PTR             LPTMR0  /* low power timer address base */
    #define configLOW_POWER_TIMER_VECTOR_NUMBER   LPTMR0_IRQn /* low power timer IRQ number */
    #define ENABLE_TICK_COUNTER()       LPTMR_StartTimer(LPTMR0_BASE_PTR); LPTMR_EnableInterrupts(LPTMR0_BASE_PTR, kLPTMR_TimerInterruptEnable)
    #define DISABLE_TICK_COUNTER()      LPTMR_StopTimer(LPTMR0_BASE_PTR)
    #define RESET_TICK_COUNTER_VAL()    LPTMR_StopTimer(LPTMR0_BASE_PTR); LPTMR_DisableInterrupts(LPTMR0_BASE_PTR, kLPTMR_TimerInterruptEnable)
    #define ACKNOWLEDGE_TICK_ISR()      LPTMR_ClearStatusFlags(LPTMR0_BASE_PTR, kLPTMR_TimerCompareFlag);
  #elif McuLib_CONFIG_SDK_VERSION_USED == McuLib_CONFIG_SDK_PROCESSOR_EXPERT
    #define ENABLE_TICK_COUNTER()       LPTMR_PDD_EnableDevice(LPTMR0_BASE_PTR, PDD_ENABLE); LPTMR_PDD_EnableInterrupt(LPTMR0_BASE_PTR)
    #define DISABLE_TICK_COUNTER()      LPTMR_PDD_EnableDevice(LPTMR0_BASE_PTR, PDD_DISABLE); LPTMR_PDD_DisableInterrupt(LPTMR0_BASE_PTR)
    #define RESET_TICK_COUNTER_VAL()    DISABLE_TICK_COUNTER()  /* CNR is reset when the LPTMR is disabled or counter register overflows */
    #define ACKNOWLEDGE_TICK_ISR()      LPTMR_PDD_ClearInterruptFlag(LPTMR0_BASE_PTR)
    #if defined(LDD_ivIndex_INT_LPTimer) /* Earlier version of Processor Expert use this vector name */
      #define configLOW_POWER_TIMER_VECTOR_NUMBER   LDD_ivIndex_INT_LPTimer
    #elif defined(LDD_ivIndex_INT_LPTMR0) /* Newer versions (Processor Expert for Kinetis v3.0.1 uses this name */
      #define configLOW_POWER_TIMER_VECTOR_NUMBER   LDD_ivIndex_INT_LPTMR0
    #else
      #error "Unknown Low Power Timer Interrupt Number?"
    #endif
  #endif
#else
  #define ENABLE_TICK_COUNTER()       portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT | portNVIC_SYSTICK_ENABLE_BIT
  #define DISABLE_TICK_COUNTER()      portNVIC_SYSTICK_CTRL_REG = portNVIC_SYSTICK_CLK_BIT | portNVIC_SYSTICK_INT_BIT
  #define RESET_TICK_COUNTER_VAL()    portNVIC_SYSTICK_CURRENT_VALUE_REG = 0 /*portNVIC_SYSTICK_LOAD_REG*/
  #define ACKNOWLEDGE_TICK_ISR()      /* not needed */
#endif

typedef unsigned long TickCounter_t; /* enough for 24 bit Systick */
#if configSYSTICK_USE_LOW_POWER_TIMER
  #define TICK_NOF_BITS               16
  #define COUNTS_UP                   1 /* LPTMR is counting up */
  #if !McuLib_CONFIG_PEX_SDK_USED
    #define SET_TICK_DURATION(val)      LPTMR_SetTimerPeriod(LPTMR0_BASE_PTR, val);
    #define GET_TICK_DURATION()         LPTMR0_BASE_PTR->CNR /*! \todo SDK has no access method for this */
    #define GET_TICK_CURRENT_VAL(addr)  *(addr)=LPTMR_GetCurrentTimerCount(LPTMR0_BASE_PTR)
  #else
    #define SET_TICK_DURATION(val)      LPTMR_PDD_WriteCompareReg(LPTMR0_BASE_PTR, val)
    #define GET_TICK_DURATION()         LPTMR_PDD_ReadCompareReg(LPTMR0_BASE_PTR)
    #define GET_TICK_CURRENT_VAL(addr)  *(addr)=LPTMR_PDD_ReadCounterReg(LPTMR0_BASE_PTR)
  #endif
#else
  #define TICK_NOF_BITS               24
  #define COUNTS_UP                   0 /* SysTick is counting down to zero */
  #define SET_TICK_DURATION(val)      portNVIC_SYSTICK_LOAD_REG = val
  #define GET_TICK_DURATION()         portNVIC_SYSTICK_LOAD_REG
  #define GET_TICK_CURRENT_VAL(addr)  *(addr)=portNVIC_SYSTICK_CURRENT_VALUE_REG
#endif

#if configSYSTICK_USE_LOW_POWER_TIMER
  #define TIMER_COUNTS_FOR_ONE_TICK     (configSYSTICK_LOW_POWER_TIMER_CLOCK_HZ/configTICK_RATE_HZ)
#else
  #define TIMER_COUNTS_FOR_ONE_TICK     (configSYSTICK_CLOCK_HZ/configTICK_RATE_HZ)
#endif

