ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-EVK/LPC55S69_McuLib_Blinky/McuLib/FreeRTOS/Source/portable/GCC/ARM_CM4F/port.c
  mrs r0, basepri
  mov r1, #configMAX_SYSCALL_INTERRUPT_PRIORITY
  msr basepri, r1
  bx r14
}
#endif /* (configCOMPILER==configCOMPILER_ARM_KEIL) */
/*-----------------------------------------------------------*/
#if (configCOMPILER==configCOMPILER_ARM_KEIL) && (configCPU_FAMILY_IS_ARM_M4_M7(configCPU_FAMILY) || configCPU_FAMILY_IS_ARM_M33(configCPU_FAMILY) /* ARM M4(F)/M7/M33 core */)
__asm void vPortClearInterruptMask(uint32_t ulNewMask) {
  PRESERVE8

  msr basepri, r0
  bx r14
}
#endif /* (configCOMPILER==configCOMPILER_ARM_KEIL) */
/*-----------------------------------------------------------*/

/*-----------------------------------------------------------*/
#if( configENABLE_MPU == 1 )
  static void prvSetupMPU( void ) /* PRIVILEGED_FUNCTION */
  {
  #if defined( __ARMCC_VERSION )
    /* Declaration when these variable are defined in code instead of being
     * exported from linker scripts. */
    extern uint32_t * __privileged_functions_start__;
    extern uint32_t * __privileged_functions_end__;
    extern uint32_t * __syscalls_flash_start__;
    extern uint32_t * __unprivileged_flash_end__;
    extern uint32_t * __privileged_sram_start__;
    extern uint32_t * __privileged_sram_end__;
  #else
    /* Declaration when these variable are exported from linker scripts. */
    extern uint32_t __privileged_functions_start__[];
    extern uint32_t __privileged_functions_end__[];
    extern uint32_t __syscalls_flash_start__[];
    extern uint32_t __unprivileged_flash_end__[];
    extern uint32_t __privileged_sram_start__[];
    extern uint32_t __privileged_sram_end__[];
  #endif /* defined( __ARMCC_VERSION ) */

    /* Check that the MPU is present. */
    if( portMPU_TYPE_REG == portEXPECTED_MPU_TYPE_VALUE )
    {
      /* MAIR0 - Index 0. */
      portMPU_MAIR0_REG |= ( ( portMPU_NORMAL_MEMORY_BUFFERABLE_CACHEABLE << portMPU_MAIR_ATTR0_POS ) & portMPU_MAIR_ATTR0_MASK );
      /* MAIR0 - Index 1. */
      portMPU_MAIR0_REG |= ( ( portMPU_DEVICE_MEMORY_nGnRE << portMPU_MAIR_ATTR1_POS ) & portMPU_MAIR_ATTR1_MASK );

      /* Setup privileged flash as Read Only so that privileged tasks can
       * read it but not modify. */
      portMPU_RNR_REG = portPRIVILEGED_FLASH_REGION;
      portMPU_RBAR_REG =  ( ( ( uint32_t ) __privileged_functions_start__ ) & portMPU_RBAR_ADDRESS_MASK ) |
                ( portMPU_REGION_NON_SHAREABLE ) |
                ( portMPU_REGION_PRIVILEGED_READ_ONLY );
      portMPU_RLAR_REG =  ( ( ( uint32_t ) __privileged_functions_end__ ) & portMPU_RLAR_ADDRESS_MASK ) |
                ( portMPU_RLAR_ATTR_INDEX0 ) |
                ( portMPU_RLAR_REGION_ENABLE );

      /* Setup unprivileged flash and system calls flash as Read Only by
       * both privileged and unprivileged tasks. All tasks can read it but
       * no-one can modify. */
      portMPU_RNR_REG = portUNPRIVILEGED_FLASH_REGION;
      portMPU_RBAR_REG =  ( ( ( uint32_t ) __syscalls_flash_start__ ) & portMPU_RBAR_ADDRESS_MASK ) |
                ( portMPU_REGION_NON_SHAREABLE ) |
                ( portMPU_REGION_READ_ONLY );
      portMPU_RLAR_REG =  ( ( ( uint32_t ) __unprivileged_flash_end__ ) & portMPU_RLAR_ADDRESS_MASK ) |
                ( portMPU_RLAR_ATTR_INDEX0 ) |
                ( portMPU_RLAR_REGION_ENABLE );

      /* Setup RAM containing kernel data for privileged access only. */
      portMPU_RNR_REG = portPRIVILEGED_RAM_REGION;
      portMPU_RBAR_REG =  ( ( ( uint32_t ) __privileged_sram_start__ ) & portMPU_RBAR_ADDRESS_MASK ) |
                ( portMPU_REGION_NON_SHAREABLE ) |
                ( portMPU_REGION_PRIVILEGED_READ_WRITE ) |
                ( portMPU_REGION_EXECUTE_NEVER );
      portMPU_RLAR_REG =  ( ( ( uint32_t ) __privileged_sram_end__ ) & portMPU_RLAR_ADDRESS_MASK ) |
                ( portMPU_RLAR_ATTR_INDEX0 ) |
                ( portMPU_RLAR_REGION_ENABLE );

      /* By default allow everything to access the general peripherals.
       * The system peripherals and registers are protected. */
      portMPU_RNR_REG = portUNPRIVILEGED_DEVICE_REGION;
      portMPU_RBAR_REG =  ( ( ( uint32_t ) portDEVICE_REGION_START_ADDRESS ) & portMPU_RBAR_ADDRESS_MASK ) |
                ( portMPU_REGION_NON_SHAREABLE ) |
                ( portMPU_REGION_READ_WRITE ) |
                ( portMPU_REGION_EXECUTE_NEVER );
      portMPU_RLAR_REG =  ( ( ( uint32_t ) portDEVICE_REGION_END_ADDRESS ) & portMPU_RLAR_ADDRESS_MASK ) |
                ( portMPU_RLAR_ATTR_INDEX1 ) |
                ( portMPU_RLAR_REGION_ENABLE );

      /* Enable mem fault. */
      portSCB_SYS_HANDLER_CTRL_STATE_REG |= portSCB_MEM_FAULT_ENABLE;

      /* Enable MPU with privileged background access i.e. unmapped
       * regions have privileged access. */
      portMPU_CTRL_REG |= ( portMPU_PRIV_BACKGROUND_ENABLE | portMPU_ENABLE );
    }
  }
#endif /* configENABLE_MPU */
/*-----------------------------------------------------------*/

#if( portUSING_MPU_WRAPPERS == 1 )
    #if( portHAS_STACK_OVERFLOW_CHECKING == 1 )
        StackType_t *pxPortInitialiseStack( StackType_t *pxTopOfStack, StackType_t *pxEndOfStack, TaskFunction_t pxCode, void *pvParameters, BaseType_t xRunPrivileged ) /*PRIVILEGED_FUNCTION*/
    #else
        StackType_t *pxPortInitialiseStack( StackType_t *pxTopOfStack, TaskFunction_t pxCode, void *pvParameters, BaseType_t xRunPrivileged ) /*PRIVILEGED_FUNCTION*/
    #endif
#else
    #if( portHAS_STACK_OVERFLOW_CHECKING == 1 )
        StackType_t *pxPortInitialiseStack( StackType_t *pxTopOfStack, StackType_t *pxEndOfStack, TaskFunction_t pxCode, void *pvParameters ) /*PRIVILEGED_FUNCTION*/
    #else
        StackType_t *pxPortInitialiseStack( StackType_t *pxTopOfStack, TaskFunction_t pxCode, void *pvParameters ) /*PRIVILEGED_FUNCTION*/
    #endif
#endif
{
  /* Simulate the stack frame as it would be created by a context switch
   * interrupt. */
  #if( portPRELOAD_REGISTERS == 0 )
  {
    pxTopOfStack--; /* Offset added to account for the way the MCU uses the stack on entry/exit of interrupts. */
    *pxTopOfStack = portINITIAL_XPSR;             /* xPSR */
    pxTopOfStack--;
    *pxTopOfStack = ( StackType_t ) pxCode;           /* PC */
    pxTopOfStack--;
    *pxTopOfStack = ( StackType_t ) portTASK_RETURN_ADDRESS;  /* LR */
    pxTopOfStack -= 5;                      /* R12, R3, R2 and R1. */
    *pxTopOfStack = ( StackType_t ) pvParameters;       /* R0 */
    pxTopOfStack -= 9;                      /* R11..R4, EXC_RETURN. */
    *pxTopOfStack = portINITIAL_EXC_RETURN;

